In [2]:
import pandas as pd
import numpy as np

In [3]:
dados = pd.read_json('dados_vendas_clientes.json')
dados

                                        dados_vendas
0  {'Data de venda': '06/06/2022', 'Cliente': ['@...
1  {'Data de venda': '07/06/2022', 'Cliente': ['I...
2  {'Data de venda': '08/06/2022', 'Cliente': ['I...
3  {'Data de venda': '09/06/2022', 'Cliente': ['J...
4  {'Data de venda': '10/06/2022', 'Cliente': ['M...

In [4]:
dados = pd.json_normalize(dados['dados_vendas'])
dados

,Data de venda,Cliente,Valor da compra
0,06/06/2022,"[@ANA _LUCIA 321, DieGO ARMANDIU 210, DieGO AR...","[R$ 836,5, R$ 573,33, R$ 392,8, R$ 512,34]"
1,07/06/2022,"[Isabely JOanes 738, Isabely JOanes 738, Isabe...","[R$ 825,31, R$ 168,07, R$ 339,18, R$ 314,69]"
2,08/06/2022,"[Isabely JOanes 738, JOãO Gabriel 671, Julya m...","[R$ 682,05, R$ 386,34, R$ 622,65, R$ 630,79]"
3,09/06/2022,"[Julya meireles 914, MaRIA Julia 444, MaRIA Ju...","[R$ 390,3, R$ 759,16, R$ 334,47, R$ 678,78]"
4,10/06/2022,"[MaRIA Julia 444, PEDRO PASCO 812, Paulo castr...","[R$ 314,24, R$ 311,15, R$ 899,16, R$ 885,24]"

In [5]:
colunas = list(dados.columns)
colunas

['Data de venda', 'Cliente', 'Valor da compra']

In [6]:
dados = dados.explode(colunas[1:])

In [7]:
dados.reset_index(inplace=True, drop=True)
dados

   Data de venda             Cliente Valor da compra
0     06/06/2022     @ANA _LUCIA 321        R$ 836,5
1     06/06/2022  DieGO ARMANDIU 210       R$ 573,33
2     06/06/2022  DieGO ARMANDIU 210        R$ 392,8
3     06/06/2022  DieGO ARMANDIU 210       R$ 512,34
4     07/06/2022  Isabely JOanes 738       R$ 825,31
5     07/06/2022  Isabely JOanes 738       R$ 168,07
6     07/06/2022  Isabely JOanes 738       R$ 339,18
7     07/06/2022  Isabely JOanes 738       R$ 314,69
8     08/06/2022  Isabely JOanes 738       R$ 682,05
9     08/06/2022    JOãO Gabriel 671       R$ 386,34
10    08/06/2022  Julya meireles 914       R$ 622,65
11    08/06/2022  Julya meireles 914       R$ 630,79
12    09/06/2022  Julya meireles 914        R$ 390,3
13    09/06/2022     MaRIA Julia 444       R$ 759,16
14    09/06/2022     MaRIA Julia 444       R$ 334,47
15    09/06/2022     MaRIA Julia 444       R$ 678,78
16    10/06/2022     MaRIA Julia 444       R$ 314,24
17    10/06/2022     PEDRO PASCO 812       R$ 311,15
18    10/06/2022    Paulo castro 481       R$ 899,16
19    10/06/2022   Thiago fritzz 883       R$ 885,24

In [8]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     object
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     object
dtypes: object(3)
memory usage: 612.0+ bytes

In [9]:
dados['Valor da compra'] = dados['Valor da compra'].apply(lambda x: x.replace('R$', '').replace(',', '').strip()).astype(np.float64)

In [10]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     object
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     float64
dtypes: float64(1), object(2)
memory usage: 612.0+ bytes

In [11]:
dados

   Data de venda             Cliente  Valor da compra
0     06/06/2022     @ANA _LUCIA 321           8365.0
1     06/06/2022  DieGO ARMANDIU 210          57333.0
2     06/06/2022  DieGO ARMANDIU 210           3928.0
3     06/06/2022  DieGO ARMANDIU 210          51234.0
4     07/06/2022  Isabely JOanes 738          82531.0
5     07/06/2022  Isabely JOanes 738          16807.0
6     07/06/2022  Isabely JOanes 738          33918.0
7     07/06/2022  Isabely JOanes 738          31469.0
8     08/06/2022  Isabely JOanes 738          68205.0
9     08/06/2022    JOãO Gabriel 671          38634.0
10    08/06/2022  Julya meireles 914          62265.0
11    08/06/2022  Julya meireles 914          63079.0
12    09/06/2022  Julya meireles 914           3903.0
13    09/06/2022     MaRIA Julia 444          75916.0
14    09/06/2022     MaRIA Julia 444          33447.0
15    09/06/2022     MaRIA Julia 444          67878.0
16    10/06/2022     MaRIA Julia 444          31424.0
17    10/06/2022     PEDRO PASCO 812          31115.0
18    10/06/2022    Paulo castro 481          89916.0
19    10/06/2022   Thiago fritzz 883          88524.0

In [12]:
dados['Cliente'] = dados['Cliente'].str.lower()

In [13]:
dados['Cliente'] = dados['Cliente'].str.replace('[^a-zA-Z\sã]', '', regex=True).str.strip()

In [14]:
dados

   Data de venda         Cliente  Valor da compra
0     06/06/2022       ana lucia           8365.0
1     06/06/2022  diego armandiu          57333.0
2     06/06/2022  diego armandiu           3928.0
3     06/06/2022  diego armandiu          51234.0
4     07/06/2022  isabely joanes          82531.0
5     07/06/2022  isabely joanes          16807.0
6     07/06/2022  isabely joanes          33918.0
7     07/06/2022  isabely joanes          31469.0
8     08/06/2022  isabely joanes          68205.0
9     08/06/2022    joão gabriel          38634.0
10    08/06/2022  julya meireles          62265.0
11    08/06/2022  julya meireles          63079.0
12    09/06/2022  julya meireles           3903.0
13    09/06/2022     maria julia          75916.0
14    09/06/2022     maria julia          33447.0
15    09/06/2022     maria julia          67878.0
16    10/06/2022     maria julia          31424.0
17    10/06/2022     pedro pasco          31115.0
18    10/06/2022    paulo castro          89916.0
19    10/06/2022   thiago fritzz          88524.0

In [15]:
dados['Data de venda'] = pd.to_datetime(dados['Data de venda'])
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Data de venda    20 non-null     datetime64[ns]
 1   Cliente          20 non-null     object
 2   Valor da compra  20 non-null     float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 612.0+ bytes

In [40]:
dados['Data de venda'].dt.strftime('%d/%m/Y%')

0     2022-06-06 00:00:00
1     2022-06-06 00:00:00
2     2022-06-06 00:00:00
3     2022-06-06 00:00:00
4     2022-07-06 00:00:00
5     2022-07-06 00:00:00
6     2022-07-06 00:00:00
7     2022-07-06 00:00:00
8     2022-08-06 00:00:00
9     2022-08-06 00:00:00
10    2022-08-06 00:00:00
11    2022-08-06 00:00:00
12    2022-09-06 00:00:00
13    2022-09-06 00:00:00
14    2022-09-06 00:00:00
15    2022-09-06 00:00:00
16    2022-10-06 00:00:00
17    2022-10-06 00:00:00
18    2022-10-06 00:00:00
19    2022-10-06 00:00:00
Name: Data de venda, dtype: object

In [41]:
maior_venda = dados.groupby(dados['Data de venda'].dt.strftime('%D %M Y%'))['Valor da compra'].sum().sort_values()
maior_venda

Data de venda
2022-06-06 00:00:00    120860.0
2022-07-06 00:00:00    164725.0
2022-09-06 00:00:00    181144.0
2022-08-06 00:00:00    232183.0
2022-10-06 00:00:00    240979.0
Name: Valor da compra, dtype: float64